---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.ProjectionPlaneInvalidWall
source: html/63fc9954-73ff-471e-9a8b-2b4b3babcaac.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.ProjectionPlaneInvalidWall Property

Projection plane becomes invalid for this wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId ProjectionPlaneInvalidWall { get; }
```